# DataFrame

In [1]:
from pandas import DataFrame

In [2]:
cars={'Make':['Ford', 'Honda', 'Toyota', 'Tesla'], 'Model':['Taurus', 'Accord', 'Canny', 'Model S'], 'MSRP':[27595, 23570, 23495, 6800]}

In [3]:
cars

{'Make': ['Ford', 'Honda', 'Toyota', 'Tesla'],
 'Model': ['Taurus', 'Accord', 'Canny', 'Model S'],
 'MSRP': [27595, 23570, 23495, 6800]}

In [4]:
type(cars)

dict

In [5]:
carData=DataFrame(cars)

In [6]:
carData

     Make    Model   MSRP
0    Ford   Taurus  27595
1   Honda   Accord  23570
2  Toyota    Canny  23495
3   Tesla  Model S   6800

In [7]:
carData.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
carData.columns

Index(['Make', 'Model', 'MSRP'], dtype='object')

In [10]:
carData['Make']

0      Ford
1     Honda
2    Toyota
3     Tesla
Name: Make, dtype: object

In [11]:
carData2=DataFrame(cars, index=[1,2,3,4])

In [12]:
carData2

     Make    Model   MSRP
1    Ford   Taurus  27595
2   Honda   Accord  23570
3  Toyota    Canny  23495
4   Tesla  Model S   6800

In [18]:
carData2['Year']=[2017 ,2018, 2019, 2019]

In [21]:
carData2

     Make    Model   MSRP  Year      Dealership
1    Ford   Taurus  27595  2017   Courtesy Ford
2   Honda   Accord  23570  2018   Capital Honda
3  Toyota    Canny  23495  2019  Spartan Toyota
4   Tesla  Model S   6800  2019             N/A

In [17]:
carData2['Dealership']=['Courtesy Ford','Capital Honda','Spartan Toyota', 'N/A']

In [20]:
carData2

     Make    Model   MSRP  Year      Dealership
1    Ford   Taurus  27595  2017   Courtesy Ford
2   Honda   Accord  23570  2018   Capital Honda
3  Toyota    Canny  23495  2019  Spartan Toyota
4   Tesla  Model S   6800  2019             N/A

In [22]:
import pandas as pd

In [23]:
import numpy as np

In [24]:
npdata=np.random.randn(5,3) #5 by 3 array.

In [25]:
npdata

array([[ 0.63120806, -0.64999202,  0.38054623],
       [-0.82359346, -2.25057698, -0.60255089],
       [-0.98412916,  1.00644053, -0.02975127],
       [-0.41101451, -0.90600892,  1.19809561],
       [ 0.52714037,  1.6710719 , -1.49124951]])

In [26]:
columnNames=['x1','x2','x3']

In [28]:
data=DataFrame(npdata, columns=columnNames)

In [29]:
data

         x1        x2        x3
0  0.631208 -0.649992  0.380546
1 -0.823593 -2.250577 -0.602551
2 -0.984129  1.006441 -0.029751
3 -0.411015 -0.906009  1.198096
4  0.527140  1.671072 -1.491250

In [30]:
data['x2']

0   -0.649992
1   -2.250577
2    1.006441
3   -0.906009
4    1.671072
Name: x2, dtype: float64

In [36]:
data.iloc[2]

x1   -0.984129
x2    1.006441
x3   -0.029751
Name: 2, dtype: float64

In [32]:
carData

     Make    Model   MSRP
0    Ford   Taurus  27595
1   Honda   Accord  23570
2  Toyota    Canny  23495
3   Tesla  Model S   6800

In [35]:
carData.iloc[1,2]

23570

In [37]:
data.T #Transpose

           0         1         2         3         4
x1  0.631208 -0.823593 -0.984129 -0.411015  0.527140
x2 -0.649992 -2.250577  1.006441 -0.906009  1.671072
x3  0.380546 -0.602551 -0.029751  1.198096 -1.491250

In [38]:
data.max()

x1    0.631208
x2    1.671072
x3    1.198096
dtype: float64

In [39]:
data.sum()

x1   -1.060389
x2   -1.129065
x3   -0.544910
dtype: float64

In [41]:
data.min()

x1   -0.984129
x2   -2.250577
x3   -1.491250
dtype: float64

In [42]:
data.min(axis=1) #minimum for each rows

0   -0.649992
1   -2.250577
2   -0.984129
3   -0.906009
4   -1.491250
dtype: float64

In [43]:
data.max()

x1    0.631208
x2    1.671072
x3    1.198096
dtype: float64

In [44]:
data.max(axis=1)

0    0.631208
1   -0.602551
2    1.006441
3    1.198096
4    1.671072
dtype: float64

In [48]:
mydata=pd.read_csv('C:\\Users\\Nashon\\Downloads\\cereals.csv',header='infer')

In [49]:
mydata

    calories  protein  fat  sodium  fiber     rating
0         70        4    1     130   10.0  68.402973
1        120        3    5      15    2.0  33.983679
2         70        4    1     260    9.0  59.425505
3         50        4    0     140   14.0  93.704912
4        110        2    2     180    1.5  29.509541
..       ...      ...  ...     ...    ...        ...
70       110        2    1     250    0.0  39.106174
71       110        1    1     140    0.0  27.753301
72       100        3    1     230    3.0  49.787445
73       100        3    1     200    3.0  51.592193
74       110        2    1     200    1.0  36.187559

[75 rows x 6 columns]

In [50]:
mydata.tail(5) #last 5

    calories  protein  fat  sodium  fiber     rating
70       110        2    1     250    0.0  39.106174
71       110        1    1     140    0.0  27.753301
72       100        3    1     230    3.0  49.787445
73       100        3    1     200    3.0  51.592193
74       110        2    1     200    1.0  36.187559

In [51]:
mydata.head(5) #first 5

   calories  protein  fat  sodium  fiber     rating
0        70        4    1     130   10.0  68.402973
1       120        3    5      15    2.0  33.983679
2        70        4    1     260    9.0  59.425505
3        50        4    0     140   14.0  93.704912
4       110        2    2     180    1.5  29.509541